intramural-sports/app/views/games/show.html.erb

<h1>Game <%=@game.id%></h1>
<h3><%=Team.find(@game.home_id).name%> vs <%=Team.find(@game.away_id).name%></h3>
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]