intramural-sports/app/controllers/games_controller.rb

SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT  "leagues".* FROM "leagues" WHERE "leagues"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
	def show
		@game = Game.find(params[:id])
		@home_team = Team.find(@game.home_id)
		@away_team = Team.find(@game.away_id)
		@league = League.find(Team.find(@game.away_id).league_id)