intramural-sports/app/controllers/players_controller.rb

  def create
    p params
    p "*" * 200
    p params[:player][:coach]
    p "*" * 200

    if params[:player][:coach] == "true"
      p "made it!!!!"
          p "*" * 200

      if params[:player][:password] == params[:player][:password_confirmation]
        player = Player.new(player_params)
      end
      if player.save
        team = Team.create(name: params[:player][:team], league_id: League.find_by(sport: params[:player][:sport]).id)
        teamplayer = PlayerTeam.create(player_id: player.id, team_id: team.id)
        session[:player_id] = player.id
        redirect_to "/leagues/#{team.league_id}/teams/#{team.id}"
      else
        redirect_to '/signup'
      end
    else
      player = Player.create(name: params[:player][:name], email: params[:player][:email], phone: params[:player][:phone], password: "123", coach: false)
      p player
      PlayerTeam.create(player_id: player.id, team_id: params[:player][:team])
      redirect_to "/leagues/#{Team.find(params[:player][:team]).league_id}/teams/#{params[:player][:team]}"
---
INSERT INTO "players" ("name", "phone", "email", "coach", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
INSERT INTO "player_teams" ("team_id", "player_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["team_id", 21], ["player_id", 201], ["created_at", 2016-08-04 22:57:34 UTC], ["updated_at", 2016-08-04 22:57:34 UTC]]
INSERT INTO "teams" ("name", "league_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "psyduck"], ["league_id", 1], ["created_at", 2016-08-04 22:57:34 UTC], ["updated_at", 2016-08-04 22:57:34 UTC]]
SELECT  "leagues".* FROM "leagues" WHERE "leagues"."sport" = $1 LIMIT $2  [["sport", "soccer"], ["LIMIT", 1]]
SELECT  "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", 201], ["LIMIT", 1]]
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]