intramural-sports/app/controllers/teams_controller.rb

  def index
    @teams = Team.where(league_id: params[:league_id])
    @league = League.find(params[:league_id])
---
SELECT "teams".* FROM "teams" WHERE "teams"."league_id" = $1  [["league_id", 1]]
SELECT  "leagues".* FROM "leagues" WHERE "leagues"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def show
    @team = Team.find(params[:id])
    @league = League.find(params[:league_id])
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT  "leagues".* FROM "leagues" WHERE "leagues"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]