intramural-sports/app/views/teams/index.html.erb

SELECT COUNT(*) FROM "players" INNER JOIN "player_teams" ON "players"."id" = "player_teams"."player_id" WHERE "player_teams"."team_id" = $1  [["team_id", 4]]
SELECT  "games".* FROM "games" WHERE ((home_id=#<Team:0x007fb5c31cb6c0>.id) OR (away_id=team.id)) LIMIT $1  [["LIMIT", 5]]
---
<li><%= team.name %>
<p><i>Players: <%= team.players.count %></i></p></li>
<p><i>Last 5 games:  <% @games = Game.where("home_id=#{team.id}").or(Game.where("away_id=#{team.id}")).limit(5) %>