intramural-sports/app/views/teams/show.html.erb

<h1><%= @team.name %> - <i><%= League.find(@team.league_id).sport %></i></h1>
<% @team.players.each do |player| %>
---
SELECT  "leagues".* FROM "leagues" WHERE "leagues"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "players".* FROM "players" INNER JOIN "player_teams" ON "players"."id" = "player_teams"."player_id" WHERE "player_teams"."team_id" = $1  [["team_id", 4]]